Я робив багато різних проектів, проте не бачу смислу їх всіх писати в резюме, бо я постарався використати все що можна в цьому проекті.
Якщо виникнуть якісь питання щодо пректу ви можете його задати під час Інтерв'ю чи на пошту. Також я можу запустити цей проект під час інтерв'ю та наглядно показати функціонал сервера.
Не судіть строго, я цей проект роблю без ніякої мети, мої методи та ідея функціоналу міняється під час виконання.

Цей проект все ще під розробкою (нових фіч, таких як Чат, кастомізація та ін.), проте деякі основні функції уже працюють, такі як реєстрація, підтвердження пошти при реєстрації, редагування профілю, створення нових постів, підписка/блокування користувачів, перегляд постів та їх коментування/оцінення (лайки/дизлайки).
Тут є пару непотрібних кастилів, які я скоро почищу, тому не судіть строго.
Щодо представлення, хочу сказати що я не дуже сильний в фронтенді, і тим більше в дизайні, тому поки що все представлення є у вигляді базових сторінок, без css/javascript, хоча в планах є розібратись із цим.


Структура проекту: не зважайте на структуру проекту, я його роблю сам, тому я посортував його під свою руку, якщо я буду працювати не сам, то мені не буде складно перейти на ваш тип структури.
